#!/usr/bin/env python
#  -*- coding: utf-8 -*-

# -----------------------------------------------------------------------------
# Name:        manageInterface.py
# Purpose:     Интерфейс менеджера реестров.
#
# Author:      <Okoneshnikov A. V.>
#
# Created:     05.06.06
# Copyright:   (c) 2006 Infocenter
# Licence:     <your licence>
# -----------------------------------------------------------------------------

"""
Интерфейс менеджера реестров.
"""

# Версия
__version__ = (0, 0, 0, 1)

class icReestrManagerInterface:
    """
    Интерфейс менеджера реестров. Класс задает функции управления реестрами и
    задает контекст реестра.
    """
    pass